Autodesk.Revit.DB.GlobalParameter.CanLabelDimension(Autodesk.Revit.DB.ElementId)
Tests whether a dimension can be labeled by the global parameter.
Remarks:
Possible causes include a dimension that cannot be labeled at all, or it is
of other than Linear or Angular type, or does not have the appropriate labeling
parameter. Other reason for this method returning False is that the data type of this
global parameter is not suitable for labeling (i.e. it contains neither Length nor Angle value).
dimensionId:
Id of a dimension element.
Returns:
True of the input dimension can be labeled by this global parameter; False oterwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Update

Autodesk.Revit.DB.GlobalParameter.LabelDimension(Autodesk.Revit.DB.ElementId)
Labels a dimension with this global parameter.
Remarks:
When a dimension is labeled by a global parameters, then its value is either
controlled by the parameter (non-reporting), or drives the value of the
parameter (reporting). It is important to note that a reporting parameter
can label at most one dimension object - meaning, a parameter can be driven
by one dimension only.
If the dimension is already labeled by another global parameter,
labeling it again will automatically detach it from that parameter.
Presently, not just any kind of dimensions may be labeled by a global parameter.
Typically only single Linear and Angular dimensions can be labeled,
but there are other restrictions in effect too. Also, for the value of the parameter
and dimension labeled by it depend on each other, the data type of the global parameters
must be either Length or Angle, since those are the only units a dimension
can represent. Refer to the CanLabelDimension(Autodesk::Revit::DB::ElementId)
method to find out whether a particular dimension element may be labeled or not.
dimensionId:
Id of a dimension element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Given element Id is not of a valid dimension element.
-or-
Dimension with the Id of dimensionId cannot be labeled by this global parameter.
Possible causes include the dimension cannot be labeled at all, or it is a dimension
of other than Linear or Angular type, or the Dimension object does not have the
appropriate labeling parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Update

Autodesk.Revit.DB.GlobalParameter.SetDrivingDimension(Autodesk.Revit.DB.ElementId)
Set a dimension to drive the value of this parameter.
Remarks:
This method is a combined action of two steps: a) Making the parameter reporting if
it is not yet, and b) Labeling the given dimension with it. Because of that, the
parameter must be eligible for reporting - i.e must be of certain types, and must
not be used to label more than one dimensions yet.
In case this parameter is already driven by another dimension, the other
dimension will be unlabeled first before the given one is labeled. It is because
a reporting parameter can only label one dimension at a time (i.e. it can be
driven by one dimension only.)
dimensionId:
Id of a dimension element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Given element Id is not of a valid dimension element.
-or-
Dimension with the Id of dimensionId cannot be labeled by this global parameter.
Possible causes include the dimension cannot be labeled at all, or it is a dimension
of other than Linear or Angular type, or the Dimension object does not have the
appropriate labeling parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This is a formula-driven parameter. As such it does not allow the current operation.
-or-
This non-reporting global parameter has already labeled other dimensions (more then 1).
It cannot, therefore, be made reporting and dimension-driven before un-labeling all
the dependent dimensions first.
Since:
2016 Subscription Update

Autodesk.Revit.DB.GlobalParameter.IsReporting
Indicates whether this is a reporting global parameter or not.
Remarks:
When a global parameter is declared as reporting, it takes its value from
the one driving dimension it is set to label. To be declared as reporting,
a parameter must be labeling exactly one dimension only. If a global parameter
is not labeling any dimensions at the time it is declared as reporting, its
its value stays unchanged until a driving dimension is labeled with it.
Reporting parameters can be (currently) only of type Length or Angle,
but programmers can always call the Autodesk.Revit.DB.GlobalParameter.HasValidTypeForReporting first
when in doubt about whether a global parameter has a data type eligible for reporting.
True if the parameter is reporting, False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The global parameter is not of a type that may be used with reporting.
Generally, a reporting parameter must be either of type Length or Angle.
-or-
When setting this property: The reporting status of the global parameter may not be presently changed!
Reasons for that include cases of currently non-reporting parameters that are already driven
by a formula, or label multiple dimensions, or are of a type that does not support reporting.
On the other hand, currently reporting parameters may not be changed if they are driven by
a locked dimension or an arc-length dimension, for those are not allowed to have their value
determined by the value of a global parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This is a formula-driven parameter. As such it does not allow the current operation.
-or-
When setting this property: This non-reporting global parameter has already labeled other dimensions (more then 1).
It cannot, therefore, be made reporting and dimension-driven before un-labeling all
the dependent dimensions first.
Since:
2016 Subscription Update

Autodesk.Revit.DB.GlobalParameter
This class represents a GlobalParameter element in Revit.
Remarks:
Global parameters can be used to drive values of dimensions or other elements' parameters.
Also, a global parameter can be driven by a selected dimension, the value of which then
determines the value of the global parameter. Such parameters can further be used to drive
values of other elements' parameters.
See also the Autodesk.Revit.DB.GlobalParametersManager class for methods
that operate upon global parameters of a document, such as getting all defined global
parameters and testing whether a global parameter of certain name already exists or not.
Reporting vs. Non-Reporting parametersThere are several ways global parameters can be categorized, but probably the most significant
categorization stems from the Autodesk.Revit.DB.GlobalParameter.IsReporting property which divides global parameters
into two groups - Reporting and Non-Reporting. The significance of reporting parameters lays in the
fact that their values are driven by the dimension that has been labeled by a reporting parameter.
It means that the value of a reporting parameter reflects the value of a dimension (length or angle)
and gets updated anytime the dimension changes. Non-Reporting parameters behave in the opposite manner
- they drive value of dimensions that have been labeled by them, which results in controlling
the model's geometry through global parameters' values.Reporting parameters are limited in several ways. They can be only of Length or Angle type,
a requirement due to the fact that a dimension must be able to drive the value. For the same reason
reporting parameters may not have formulas.Non-Reporting parameters, on the other way, can be of almost any type (Length, Integer,
Area, etc.) with the exception of ElementId type. Also, Non-Reporting parameters may have assigned
formulas in which other global parameters may be used as arguments. This way one global parameter's value
can be derived from other parameter (or parameters), and the other parameter can be either reporting
or non-reporting.Creating Global ParametersGlobal parameters get created via the static method Autodesk.Revit.DB.GlobalParameter.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.ParameterType). It is important to note that each
new parameter must have a name that is unique within the document. Parameters are created as non-reporting
initially, but programmers are free to modify the Autodesk.Revit.DB.GlobalParameter.IsReporting property once a global parameter
is created and is of an eligible type. The programmer can call the Autodesk.Revit.DB.GlobalParameter.HasValidTypeForReporting
when in doubt whether parameters of a certain data type can be made reporting. Note, that a parameter
may not be made reporting after more than one dimension has been labeled by it. It is because reporting
parameter can label (and be driven) by one dimension only.An alternative way of making a parameter reporting is via the Autodesk.Revit.DB.GlobalParameter.SetDrivingDimension(Autodesk.Revit.DB.ElementId) method which
labels one dimension by a global parameter and also makes the parameter reporting if it is not reporting yet.Other important properties of global parameters are Autodesk.Revit.DB.GlobalParameter.IsDrivenByDimension and
Autodesk.Revit.DB.GlobalParameter.IsDrivenByFormula, which are mutually exclusive - a parameter that has a formula
assigned cannot be driven by a dimension (nor can be reporting) and vice versa. Global Parameters with formulasLike with family parameters, formulas may be assigned to non-reporting global parameters using the
Autodesk.Revit.DB.GlobalParameter.SetFormula(System.String) method (paired with Autodesk.Revit.DB.GlobalParameter.GetFormula to query the current formula.)
Formulas may include all standard arithmetic operations and logical operations (as functions and, or, not.)
Input to logical operations must be Boolean values (parameters of YesNo type). Consequently, arithmetic
operations can be applied to numeric values only. While there are no operations supported for string (text)
arguments, strings can be used as results of a logical If operation. Depending on their type (and units),
parameters of different value types can be combined. However, unit-less values such as Integer and
Number (double) may only be combined with each other. Since formulas can get quite complicated,
the method Autodesk.Revit.DB.GlobalParameter.IsValidFormula(System.String) is available for the programmer to ensure a formula is valid
in order to avoid potential exception due to applying an invalid formula.Labeling dimensionsProbably the most notable feature of global parameters is their ability to "Label" dimensions,
a process that establishes dependency of a dimension on a global parameter (or vice versa,
depending on the reporting status.) One parameter can label any number of dimensions as long
as the parameter is non-reporting. As mentioned above, reporting parameter can label one dimension
only. Methods and properties related to labeling include: Autodesk.Revit.DB.GlobalParameter.LabelDimension(Autodesk.Revit.DB.ElementId),
Autodesk.Revit.DB.GlobalParameter.UnlabelDimension(Autodesk.Revit.DB.ElementId), and Autodesk.Revit.DB.GlobalParameter.GetLabeledDimensions. Also in this set is the
Autodesk.Revit.DB.GlobalParameter.CanLabelDimension(Autodesk.Revit.DB.ElementId) method which indicates whether or not a particular dimension
can be labeled. Presently, only single linear dimensions and angles are permitted.Elements affected by a Global ParameterGlobal parameters can be associated with other global parameters as well as regular family instance
parameters (which may report global parameters as their values via the assignment formula.)
There are two methods available to find relations among parameters: Autodesk.Revit.DB.GlobalParameter.GetAffectedGlobalParameters
and Autodesk.Revit.DB.GlobalParameter.GetAffectedElements. The former returns all other global parameters that refer
to a particular global parameter in their respective formulas. The other method returns a set
of all elements of which some parameters are controlled by the global parameter. These two methods
together with the Autodesk.Revit.DB.GlobalParameter.GetLabeledDimensions can help the programmer in figuring out
how model elements relate to each other via global parameters.Methods for maintaining associations between element properties and global parameters
can be found in the Autodesk.Revit.DB.Parameter class.Getting and setting the value of a Global ParameterAll global parameters, formula-driven, dimension-driven, or independent, have values. A value can
be obtained by calling the Autodesk.Revit.DB.GlobalParameter.GetValue method. The object returned by that method is an instance
of one of the classes derived from Autodesk.Revit.DB.ParameterValue class. The concrete
instance is determined by the type of the global parameter (specified upon creation.) Parameters that are
neither formula-driven nor dimension-driven (reporting) can have a value assigned. The method to use
is Autodesk.Revit.DB.GlobalParameter.SetValue(Autodesk.Revit.DB.ParameterValue) and it accepts the same type of Autodesk.Revit.DB.ParameterValue
that is returned by SetValue. However, the type can also be deduced easily: Text parameters accept only
Autodesk.Revit.DB.StringParameterValue. Integer and YesNo parameters accept only
Autodesk.Revit.DB.IntegerParameterValue. All other parameters accept only
Autodesk.Revit.DB.DoubleParameterValue.
Since:
2016 Subscription Update